IF ( ( SELECT COUNT(*) FROM AUTHORS WITH(NOLOCK) ) <= 0 )
BEGIN
	INSERT INTO AUTHORS
	VALUES ('Антоан дьо Сент- Екзюпери')
		 , ('Хорхе Букай')
		 , ('Джериес Авад')
		 , ('Робин Шарма')
		 , ('Ронда Бърн')
		 , ('Ян ван Хелсинг')
		 , ('Дан Браун')
		 , ('Анди Андрюс')
		 , ('Елизабет Гилбърт')
		 , ('Джеф Кини')
		 , ('Харпър Ли')
	END
GO

IF ( ( SELECT COUNT(*) FROM PUBLISHERS WITH(NOLOCK) ) <= 0 )
BEGIN
	INSERT INTO PUBLISHERS
	VALUES ('Лъчезар Минчев')
		  ,('Хермес')
		  ,('AMG Publishing')
		  ,('Екслибрис')
		  ,('Изток-Запад')
		  ,('Дилок')
		  ,('Бард')
		  ,('Skyprint')
		  ,('Прозорец')
		  ,('ДуоДИЗАЙН')
END
GO

IF ( ( SELECT COUNT(*) FROM BOOKS WITH(NOLOCK) ) <= 0 )
BEGIN
	INSERT INTO BOOKS
	VALUES ('Малкият принц', 'Намерете място в сърцето си за Малкия принц. Той обитава миниатюрна планета с три вулкана (единият - угаснал). Всеки ден води борба с опасните баобаби. Докато не открива едно цвете, което иска от него нещо повече от грижа. 
	Малкият принц поема на пътешествие. Ще открие много малки планети с чудати обитатели, а накрая ще слезе и на Земята, където ще се срещне с изгубен в пустинята пилот, една неопитомена лисица и хиляди рози, които поразително приличат на неговото цвете - но не са като него, защото то е единствено.', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Антоан дьо Сент- Екзюпери'), 5.99, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Лъчезар Минчев'), 2003, 'little-prince.jpg')
		 , ('Нека ти разкажа', 'Какво трябва да направим, за да сме щастливи? Според Букай, за да тръгнем по правилния път, трябва да си отговорим на следните въпроси: Кой съм? Къде отивам? С кого? Не бива пътят да определя кои сме ние, нито пък човекът, който ни придружава, да решава къде отиваме. По пътя трябва едновременно да се забавляваме и да се учим, да оценяваме това, което имаме, и без да преставаме да вярваме в себе си, да започваме отначало и по различен начин „всеки път, когато се наложи”.', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Хорхе Букай'), 10.50, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Хермес'), 2008, 'letmetellyou.jpg')
		 , ('Скритият дар', '„Скритият дар“ е колекция от 101 притчи, които Джериес Авад събира от близо и далеч. Той искрено се надява, че те ще ви вдъхновят да търсите и откривате необикновеното в обикновените неща, защото както се казва в една от историите: „Ако вашият подарък не е опакован така, както сте очаквали, то е защото е бил опакован много по-добре“.', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Джериес Авад'), 8, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'AMG Publishing'), 2010, '')
		 , ('Монахът, който продаде своето Ферари', '"Монахът, който продаде своето ферари" е историята на Джулиан Мантъл, адвокат със звездна репутация, чийто небалансиран стил на живот е причина за почти фатален сърдечен удар в претъпканата съдебна зала. Физическият срив води до духовна криза и Джулиан е принуден да преразгледа живота си и да потърси отговор на най-важните въпроси. С надежда да намери щастие и удовлетворение той се впуска в една изключителна одисея.', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Робин Шарма'), 12.25, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Екслибрис'), 2004, '')
		 , ('Тайната/ The Secret', 'Фрагменти от Голямата тайна са откривани пред вековете в устните традиции, в литературата, в различните религиозни и философски учения. За първи път всички парчета на Тайната са събрани заедно в едно невероятно откровение, което ще промени живота на всички, до които достигне.', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Ронда Бърн'), 4.50, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Изток-Запад'), 2008, '')
		 , ('Не пипай тази книга!', 'Ян ван Хелсинг отново ще разтърси светогледа Ви! Не пипай тази книга! - защото след това наистина няма да е лесно да живеете по стария начин. Ако сте човек, който не се интересува от тайни, който никога не е желал да бъде външно и вътрешно богат, който не се е питал как да постигне успех и добро здраве, тогава книгата не е за Вас. ', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Ян ван Хелсинг'), 10, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Дилок'), 2007, '')
		 , ('Ад', 'Разиграващ се на невероятен фон, вдъхновен от една от най-зловещите литературни класики в историята, „Ад” е най-завладяващият и предизвикващ размисъл роман на Дан Браун досега - задъхана надпревара с времето, която ще ви грабне още от първата страница и няма да ви остави до последната.', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Дан Браун'), 12.19, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Бард'), 2016, '')
		 , ('Проницателят', 'Понякога всичко, от което човек се нуждае, е нова гледна точка. Бедност. Пропадащи бракове. Старост. Изгубени надежди. Банкрут. Несигурно бъдеще. Жителите на Ориндж Бийч, Алабама, се сблъскват с всички тези проблеми, захвърлени в самота и безсилие да променят живота си. Но за един стар скитник, благословен с дарбата да вижда онова, което другите пропускат, няма безизходна ситуация. Тайнственият Джоунс обикаля из крайбрежния град и дава помощ на всеки отчаян, посявайки в душите мъдрост и безсмъртна надежда.',(SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Анди Андрюс'), 8, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Skyprint'), 2010, 'noticer.jpg')
		 , ('Яж, моли се и обичай', '"Успокояваща и вдъхновяваща, написана с невероятно остроумие, тази книга е за всеки, който някога е губил нещо или си е казвал, че би трябвало да има и друг, по-добър път."
	Ню Йорк Таймс', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Елизабет Гилбърт'), 6, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Прозорец'), 2008, '')
		 , ('Изгубеният символ', 'Писан в продължение на шест години романът "Изгубеният символ" е изключително продължение на световните бестселъри на Дан Браун, "Шестото Клеймо" и "Шифърът на Леонардо", в които главен герой е Робърт Лангдън.', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Дан Браун'), 14.50, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Бард'), 2009, '')
		 , ('Приказки за размисъл', '', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Хорхе Букай'), 10, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Хермес'), 2009, '')
		 , ('Дневникът на един Дръндьо Кн.1', 'Да си дете може да бъде наистина кофти. Никой не знае това по-добре от Грег Хефли, който прекарва дните си в основното училище. Там дребни слабаци делят коридорите с грубияни, които са по- едри, по-гадни и вече се бръснат. В Дневникът на един дръндьо авторът и илюстратор Джеф Кини ни запознава с един неочакван герой. Както казва Грег в дневника си: " Само не очаквайте да пиша в стил " Мило дневниче, това", " Скъпо дневниче, онова".
	', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Джеф Кини'), 5, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'ДуоДИЗАЙН'), 2010, '')
		 , ('Да убиеш присмехулник', 'Един от най-обичаните романи с петдесетгодишна история!
	„Да убиеш присмехулник" остава в световната белетристика като изключителен литературен феномен. Весел, забавен и написан с естествена прецизност, този южняшки роман и днес не е изгубил своя блясък. ', (SELECT ID FROM AUTHORS WITH(NOLOCK) WHERE NAME = 'Харпър Ли'), 16.99, (SELECT ID FROM PUBLISHERS WITH(NOLOCK) WHERE NAME = 'Бард'), 2011, '')
END
GO

IF ( ( SELECT COUNT(*) FROM READERS WITH(NOLOCK) ) <= 0 )
BEGIN
	INSERT INTO READERS
	VALUES ('Златка','Димитрова','Георгиева','Варна ул.Ябълка 12', 2, '0555666777','')
		 , ('Иван','Димитров','Иванов','София ул.Кестен 16', 1, '0555666778', '')
		 , ('Матей','Матеев','Александров','Бургас ул.Круша 8', 1, '0555666799', '')
		 , ('Александра','Красимирова','Стефанова','Варна ул.Дъб 45', 2, '0555666765', '')
		 , ('Мариана','Калоянова','Петрова','Пловдив ул.Слънчоглед 29', 2, '0555666712', '')
		 , ('Калоян','Николаев','Димитров','Русе ул.Младост 15', 1, '0555666734', '')
END
GO

SELECT * FROM AUTHORS
SELECT * FROM PUBLISHERS
SELECT * FROM BOOKS
SELECT * FROM READERS

